//Задача “со звездочкой”: Напишите функцию, которая принимает одно число - высоту елочки и рисует ее в консоли звездочками.
Console.Clear();
Console.WriteLine("Введите число, которое будет высотой ёлки - ");
